# В вашей базе данных есть таблица "Books" со следующими столбцами: "id" (целое число, первичный ключ), "title"
# (текстовый тип), "author" (текстовый тип), "year" (целое число) и "price" (вещественный тип). Вам необходимо
# выполнить следующие действия:
# - вставьте несколько записей в таблицу "Books" с информацией о различных книгах, включая название, автора,
# год издания и цену.
# - выберите все записи из таблицы "Books", отсортированные по году издания в порядке возрастания.
# - выберите книги, у которых цена выше определенного значения.
# - обновите цену книги с определенным ID.
# - удалите книги, у которых год издания меньше определенного значения
